Data Wrangling and Manipulation with Pandas

Pandas

In [6]:
import pandas

In [15]:
pandas.Series([1,2,3,4,5])  #index is row  #0 to 4 are the index

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [10]:
import pandas as pd

In [11]:
a=pd.Series([1,2,3,4,5])

In [12]:
a

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [13]:
b=pd.Series([10,20,30,40,50])

In [14]:
b

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [16]:
c=pd.Series([12.4,56.3,22.7,89.2,11.7])

In [17]:
c

0    12.4
1    56.3
2    22.7
3    89.2
4    11.7
dtype: float64

In [20]:
d=pd.Series

In [26]:
d=pd.Series(data=[12,24,56,89,21,99,82])   #default index

In [23]:
d

0    12
1    24
2    56
3    89
4    21
5    99
6    82
dtype: int64

In [27]:
d=pd.Series(data=[12,24,56,89,21],index=[11,12,13,14,15])   #index changing

In [25]:
d

11    12
12    24
13    56
14    89
15    21
dtype: int64

In [28]:
e=pd.Series(data=[10,20,30,40,50,60])

In [29]:
e

0    10
1    20
2    30
3    40
4    50
5    60
dtype: int64

In [38]:
e=pd.Series(data=[10,20,30,40,50,60],index=[1,2,3,4,5,6],dtype='int64')

In [40]:
e

1    10
2    20
3    30
4    40
5    50
6    60
dtype: int64

In [39]:
f=pd.Series(data=[10,20,30,40,50,60],index=[1,2,3,4,5,6],dtype='float64')

In [34]:
f

1    10.0
2    20.0
3    30.0
4    40.0
5    50.0
6    60.0
dtype: float64

In [35]:
import numpy as np
a=np.array([67,68,69,70])
a

array([67, 68, 69, 70])

In [36]:
h=pd.Series(a)

In [37]:
h

0    67
1    68
2    69
3    70
dtype: int32

In [41]:
d={'empid':101,'empname':'Jhon'}
d

{'empid': 101, 'empname': 'Jhon'}

In [43]:
pd.Series(data=d)

empid       101
empname    Jhon
dtype: object

DataFrame 

Pandas.DataFrame

In [46]:
a=pd.DataFrame([12,23,4,5,6])
a

    0
0  12
1  23
2   4
3   5
4   6

In [47]:
b=[['Jhon',24],['Jack',26],['Anderw',28]]
b

[['Jhon', 24], ['Jack', 26], ['Anderw', 28]]

In [48]:
pd.DataFrame(b)

        0   1
0    Jhon  24
1    Jack  26
2  Anderw  28

In [50]:
pd.DataFrame

pandas.core.frame.DataFrame

In [51]:
pd.DataFrame(data=b,columns=['Name','Age'])

     Name  Age
0    Jhon   24
1    Jack   26
2  Anderw   28

In [58]:
pd.DataFrame(data=b,index=['row1','row2','row3'],columns=['Name','Age'])

        Name  Age
row1    Jhon   24
row2    Jack   26
row3  Anderw   28

In [59]:
dict1={'studid':1,'Name':'Smith','Age':12}

In [60]:
dict1

{'studid': 1, 'Name': 'Smith', 'Age': 12}

In [63]:
dict1={'studid':[1,2,3],'Name':['Smith','Jack','Jhon'],'Age':[12,11,14]}

In [64]:
dict1

{'studid': [1, 2, 3], 'Name': ['Smith', 'Jack', 'Jhon'], 'Age': [12, 11, 14]}

In [65]:
pd.DataFrame(dict1)

   studid   Name  Age
0       1  Smith   12
1       2   Jack   11
2       3   Jhon   14

In [66]:
h=pd.DataFrame(data=dict1)

In [67]:
h

   studid   Name  Age
0       1  Smith   12
1       2   Jack   11
2       3   Jhon   14

In [68]:
data=[{'a': 1, 'b' :2},{'a': 5, 'b': 10, 'c': 20}]

In [69]:
df=pd.DataFrame(data,dtype=float)
print(df)

     a     b     c
0  1.0   2.0   NaN
1  5.0  10.0  20.0

In [70]:
df= pd.DataFrame(data,columns=['a','b'])

In [71]:
df

   a   b
0  1   2
1  5  10

In [72]:
df=pd.DataFrame(data,columns=['a','c'])

In [73]:
df

   a     c
0  1   NaN
1  5  20.0

In [75]:
df=pd.DataFrame(data,columns=['a'])

In [76]:
df

   a
0  1
1  5

In [79]:
df=pd.DataFrame(data,columns=['a','p'])  #empty columns filled with NAN values

In [78]:
df

   a   p
0  1 NaN
1  5 NaN

Indexing and Slicing in Pandas

In [7]:
import pandas as pd
import numpy as np

In [8]:
#df=pd.DataFrame(np.random.randn(8,4),index=['a','b','c','d','e','f','g','h'],columns=['A','B','C','D']
#df

df=pd.DataFrame(np.random.randn(8,4),columns=['A','B','C','D'])

In [9]:
df

          A         B         C         D
0  1.068777  1.711679  0.110409  1.644772
1 -0.104892  0.751573  2.151240  0.294803
2 -0.949295 -1.377619 -0.116961  0.413530
3  0.078866  0.335283  0.187836 -1.772529
4  1.633979  1.912364  1.030730 -0.968182
5 -0.477268 -1.054134  1.944005  1.847436
6 -0.670498 -0.131356  0.356710  0.699662
7 -0.811237  1.815239  0.705542 -1.445072

In [10]:
df=pd.DataFrame(np.random.randn(6,4),columns=['A','B','C','D'])

In [11]:
df

          A         B         C         D
0 -0.929395 -2.280813 -0.338576 -0.385702
1  0.918204 -0.390473  0.825526 -1.080448
2 -0.158437  1.705163 -0.782617 -1.345561
3 -1.922199  1.619203 -0.724498  0.184381
4 -0.032647  1.861126 -0.603237 -1.148996
5 -0.052348  0.514655  0.556965  0.876844

In [12]:
df.loc[:,'A']

0   -0.929395
1    0.918204
2   -0.158437
3   -1.922199
4   -0.032647
5   -0.052348
Name: A, dtype: float64

In [13]:
df.loc[:,'B']

0   -2.280813
1   -0.390473
2    1.705163
3    1.619203
4    1.861126
5    0.514655
Name: B, dtype: float64

In [14]:
df.loc[:,'C']

0   -0.338576
1    0.825526
2   -0.782617
3   -0.724498
4   -0.603237
5    0.556965
Name: C, dtype: float64

In [15]:
df.loc[:,'D']

0   -0.385702
1   -1.080448
2   -1.345561
3    0.184381
4   -1.148996
5    0.876844
Name: D, dtype: float64

In [16]:
df

          A         B         C         D
0 -0.929395 -2.280813 -0.338576 -0.385702
1  0.918204 -0.390473  0.825526 -1.080448
2 -0.158437  1.705163 -0.782617 -1.345561
3 -1.922199  1.619203 -0.724498  0.184381
4 -0.032647  1.861126 -0.603237 -1.148996
5 -0.052348  0.514655  0.556965  0.876844

In [17]:
df=pd.DataFrame(np.random.rand(4,4),columns=['A','B','C','D'],index=['a','b','c','d'])

In [18]:
df

          A         B         C         D
a  0.997993  0.895609  0.382545  0.147574
b  0.054440  0.416754  0.115754  0.034234
c  0.948607  0.594593  0.120215  0.351055
d  0.108764  0.053796  0.499116  0.166797

In [19]:
df.loc['a':'b','A']

a    0.997993
b    0.054440
Name: A, dtype: float64

In [20]:
df.loc['a':'d','A']

a    0.997993
b    0.054440
c    0.948607
d    0.108764
Name: A, dtype: float64

In [21]:
df.loc['a':'d','C']

a    0.382545
b    0.115754
c    0.120215
d    0.499116
Name: C, dtype: float64

In [22]:
df.loc[:,['C','D']]

          C         D
a  0.382545  0.147574
b  0.115754  0.034234
c  0.120215  0.351055
d  0.499116  0.166797

In [23]:
df.loc[:,:]

          A         B         C         D
a  0.997993  0.895609  0.382545  0.147574
b  0.054440  0.416754  0.115754  0.034234
c  0.948607  0.594593  0.120215  0.351055
d  0.108764  0.053796  0.499116  0.166797

In [24]:
df.loc['a':'b',:]

          A         B         C         D
a  0.997993  0.895609  0.382545  0.147574
b  0.054440  0.416754  0.115754  0.034234

In [25]:
df.loc['a':'b',:]

          A         B         C         D
a  0.997993  0.895609  0.382545  0.147574
b  0.054440  0.416754  0.115754  0.034234

In [26]:
df

          A         B         C         D
a  0.997993  0.895609  0.382545  0.147574
b  0.054440  0.416754  0.115754  0.034234
c  0.948607  0.594593  0.120215  0.351055
d  0.108764  0.053796  0.499116  0.166797

In [29]:
df=pd.DataFrame(np.random.rand(7,5))
df

          0         1         2         3         4
0  0.733072  0.649039  0.735345  0.633395  0.646713
1  0.599824  0.051027  0.026764  0.834425  0.325852
2  0.381558  0.773475  0.506347  0.488302  0.281610
3  0.793897  0.821356  0.157216  0.953835  0.937248
4  0.232108  0.550504  0.916739  0.232150  0.848648
5  0.203721  0.514874  0.921200  0.501452  0.641981
6  0.762674  0.813092  0.541980  0.890543  0.215953

In [31]:
df.iloc[:,0]

0    0.733072
1    0.599824
2    0.381558
3    0.793897
4    0.232108
5    0.203721
6    0.762674
Name: 0, dtype: float64

In [32]:
df.iloc[0:4,0]

0    0.733072
1    0.599824
2    0.381558
3    0.793897
Name: 0, dtype: float64

In [33]:
df.iloc[1:6,2]

1    0.026764
2    0.506347
3    0.157216
4    0.916739
5    0.921200
Name: 2, dtype: float64

In [34]:
df.iloc[:,3]

0    0.633395
1    0.834425
2    0.488302
3    0.953835
4    0.232150
5    0.501452
6    0.890543
Name: 3, dtype: float64

In [35]:
df.iloc[2:5,3]

2    0.488302
3    0.953835
4    0.232150
Name: 3, dtype: float64

In [36]:
df.iloc[0:6,1:3]

          1         2
0  0.649039  0.735345
1  0.051027  0.026764
2  0.773475  0.506347
3  0.821356  0.157216
4  0.550504  0.916739
5  0.514874  0.921200